backend/loadtest/artillery.yml
config:
  target: "https://api.atompay.co.in"
  phases:
    # Phase 1: Warm-up — 5 virtual users per second for 30s
    - duration: 30
      arrivalRate: 5
      name: "Warm-up"
    # Phase 2: Ramp-up — 5 to 50 virtual users per second over 60s
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Ramp-up"
    # Phase 3: Sustained peak load — 50 virtual users per second for 30s
    - duration: 30
      arrivalRate: 50
      name: "Sustained peak"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  # Scenario 1: Health check (GET /api)
  - name: "Health Check"
    weight: 40
    flow:
      - get:
          url: "/api"
          expect:
            - statusCode: 200

  # Scenario 2: Login flow — send OTP then verify
  - name: "Login with OTP"
    weight: 20
    flow:
      - post:
          url: "/api/auth/send-otp"
          json:
            email: "loadtest@atompay.co.in"
            password: "loadtest123"
          capture:
            - json: "$.msg"
              as: "otpMsg"
          expect:
            - statusCode:
                - 200
                - 404
                - 429

  # Scenario 3: Invalid login (tests error path performance)
  - name: "Invalid Login"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "nonexistent_loadtest@example.com"
            password: "wrongpassword123"
          expect:
            - statusCode:
                - 404
                - 429

  # Scenario 4: Signup validation (tests Zod validation path)
  - name: "Signup Validation"
    weight: 10
    flow:
      - post:
          url: "/api/auth/signup"
          json:
            email: "bad-email"
          expect:
            - statusCode:
                - 400
                - 429

  # Scenario 5: Unauthenticated wallet access
  - name: "Wallet Auth Check"
    weight: 10
    flow:
      - get:
          url: "/api/wallet/balance"
          expect:
            - statusCode:
                - 401